Revit 2024 API
FilterIntegerRule.RuleValue Property
 The user-supplied value against which values from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int RuleValue { get; set; }
Visual Basic
Public Property RuleValue As Integer
	Get
	Set
Visual C++
public:
property int RuleValue {
	int get ();
	void set (int value);
}
See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace